Repository: sugar-activities/4682-activity
Catalog: po/*.po
Languages: fr

source: Turtle Blocks
fr: BlocsTortue

source: Turtle Art
fr: ArtTortue

source: Turtle Art Mini
fr: ArtTortue Mini

source: Turtle Confusion
fr: Confusion tortue

source: Select a challenge
fr: Sélectionner un défi

source: Amazonas Tortuga
fr: Tortues amazoniennes

source: Turtle Flags
fr: Tortue drapeaux

source: Use the turtle to draw country flags
fr: Utilise la tortue pour dessiner les drapeaux des pays

source: Palette of Mexican pesos
fr: Palette de pesos mexicains

source: Palette of Colombian pesos
fr: Palette de pesos colombiens

source: Palette of Rwandan francs
fr: Palette de francs rwandais

source: Palette of US dollars
fr: Palette de dollars américains

source: Palette of Australian dollars
fr: Palette de dollars australiens

source: Palette of Paraguayan Guaranies
fr: Palette de guaranis du Paraguay

source: TurtleBlocks with Butia, Lego NxT, WeDo, Arduino, FollowMe plugins
fr: BlocsTortue avec les modules Butia, Lego NxT, WeDo, Arduino, FollowMe

source: ERROR: The speed must be a value between 0 and 1023
fr: ERREUR : la vitesse doit être une valeur entre 0 et 1023

source: ERROR: The speed must be a value between -1023 and 1023
fr: ERREUR : la vitesse doit être une valeur entre -1023 et 1023

source: ERROR: The pin must be between 1 and 8
fr: ERREUR : La broche doit être réglée entre 1 et 8

source: ERROR: The value must be 0 or 1, LOW or HIGH
fr: ERREUR : La valeur doit être 0 ou 1. BAS ou HAUT

source: ERROR: The mode must be INPUT or OUTPUT.
fr: ERREUR : Le mode doit être ENTRÉE ou SORTIE.

source: turns LED on and off: 1 means on, 0 means off
fr: allume et éteint les DEL : 1 pour allumé, 0 pour éteint

source: returns the gray level as a value between 0 and 65535
fr: retourne le niveau de gris avec une valeur entre 0 et 65535

source: returns 1 when the button is pressed and 0 otherwise
fr: renvoie 1 lorsque le bouton est actionné et 0 dans le cas contraire

source: returns the light level as a value between 0 and 65535
fr: retourne le niveau de luminosité avec une valeur entre 0 et 65535

source: returns the distance as a value between 0 and 65535
fr: retourne la distance avec une valeur entre 0 et 65535

source: returns the resistance value (ohms)
fr: retourne la valeur de résistance (ohms)

source: returns the voltage value (volts)
fr: retourne la valeur de tension (volts)

source: returns the temperature value (celsius degree)
fr: retourne la valeur de température (degrés Celsius)

source: custom module %s
fr: module personnalisé %s

source: LED
fr: DEL

source: button
fr: bouton

source: gray
fr: gris

source: light
fr: lumière

source: resistance
fr: résistance

source: voltage
fr: tension

source: temperature
fr: température

source: sensor a
fr: capteur a

source: sensor b
fr: capteur b

source: sensor c
fr: capteur c

source: actuator a
fr: actuateur a

source: actuator b
fr: actuateur b

source: actuator c
fr: actuateur c

source: Butia Robot
fr: Robot Butia

source: refresh Butia
fr: rafraîchir Butia

source: refresh the state of the Butia palette and blocks
fr: réinitialiser la palette et les blocs Butia

source: battery charge Butia
fr: charge de la batterie Butia

source: returns the battery charge in volts. If no motors present, it returns 255
fr: retourne la charge de la batterie en volts. S'il n'y a pas de moteur, retourne 255

source: speed Butia
fr: vitesse Butia

source: set the speed of the Butia motors
fr: définit la vitesse des moteurs de Butia

source: move Butia
fr: déplace Butia

source: left
fr: gauche

source: right
fr: droite

source: moves the Butia motors at the specified speed
fr: déplace les moteurs de Butia à la vitesse spécifiée

source: stop Butia
fr: arrête Butia

source: stop the Butia robot
fr: arrêter le robot Butia

source: forward Butia
fr: faire avancer Butia

source: move the Butia robot forward
fr: fait avancer le robot Butia

source: left Butia
fr: tourne Butia vers la gauche

source: turn the Butia robot at left
fr: tourner le robot Butia vers la droite

source: right Butia
fr: tourne Butia vers la droite

source: turn the Butia robot at right
fr: tourner le robot Butia vers la droite

source: backward Butia
fr: faire reculer Butia

source: move the Butia robot backward
fr: fait reculer le robot Butia

source: Butia Robot extra blocks
fr: Blocs supplémentaires robot Butia

source: pin mode Butia
fr: mode broche Butia

source: Select the pin function (INPUT, OUTPUT).
fr: Choisir la fonction de la broche (ENTRÉE, SORTIE).

source: read pin Butia
fr: lire la broche Butia

source: read the value of a pin
fr: lire la valeur d'une broche

source: write pin Butia
fr: écrire la broche Butia

source: value
fr: valeur

source: set a hack pin to 0 or 1
fr: fixe une broche hack à 0 ou 1

source: INPUT
fr: ENTRÉE

source: Configure hack pin for digital input.
fr: Configurer la broche hack pour une entrée numérique.

source: HIGH
fr: HAUT

source: Set HIGH value for digital pin.
fr: Définir la valeur HAUT de la broche numérique.

source: LOW
fr: BAS

source: Set LOW value for digital port.
fr: Définir BAS comme la valeur du port digital.

source: OUTPUT
fr: SORTIE

source: Configure hack port for digital output.
fr: Configurer le port hack pour la sortie numérique.

source: Butia Robot cast blocks
fr: Blocs transtypage robot Butia

source: CAST
fr: TRANSTYPAGE

source: new name
fr: nouveau nom

source: name
fr: nom

source: Cast a new block
fr: Transtyper un nouveau bloc

source: generic module %s
fr: Module générique %s

source: ERROR: The pin %s must be in OUTPUT mode.
fr: ERREUR : La broche %s doit être en mode SORTIE.

source: ERROR: The pin %s must be in INPUT mode.
fr: ERREUR : La broche %s doit être en mode ENTRÉE.

source: ERROR: Something wrong with function '%s'
fr: ERREUR : problème avec la fonction '%s'

source: ERROR: cannot init GCONF client: %s
fr: ERREUR : initialisation du client GCONF impossible : %s

source: ERROR: You must cast Sensor or Actuator: A, B or C
fr: ERREUR : transtypage du capteur ou de l'actuateur : A, B ou C requis

source: Creating PyBot server
fr: Création du serveur PyBot

source: ERROR creating PyBot server
fr: ERREUR lors de la création du serveur PyBot

source: PyBot is alive!
fr: PyBot est actif !

source: Ending butia polling
fr: Fin de l'interrogation butia

source: Error importing Pygame. This plugin require Pygame 1.9
fr: Erreur lors de l'importation de Pygame. Cette extension nécessite Pygame 1.9

source: Error on initialization of the camera
fr: Erreur lors de l'initialisation de la caméra

source: No camera was found
fr: Aucune caméra n'a été trouvée

source: Error stopping camera
fr: Erreur lors de l'arrêt de la caméra

source: Error starting camera
fr: Erreur lors du démarrage de la caméra

source: Error in get mask
fr: Erreur du masque

source: FollowMe
fr: SuisMoi

source: refresh FollowMe
fr: rafraîchir SuisMoi

source: Search for a connected camera.
fr: Recherche d'une caméra connectée.

source: store a personalized calibration
fr: enregistrer une calibration personnalisée

source: return a personalized calibration
fr: retourner une calibration personnalisée

source: follow
fr: suivre

source: follow a color or calibration
fr: suivre une couleur ou une calibration

source: brightness
fr: luminosité

source: set the camera brightness as a value between 0 to 255.
fr: définit la luminosité de la caméra à une valeur entre 0 et 255.

source: minimum pixels
fr: nombre minimal de pixels

source: set the minimal number of pixels to follow
fr: définir le nombre minimal de pixels à suivre

source: threshold
fr: limite

source: set a threshold for a RGB color
fr: définir une limite pour une couleur RVB

source: camera mode
fr: mode caméra

source: set the color mode of the camera: RGB; YUV or HSV
fr: définit le mode couleur de la caméra: RGB, YUV ou HSV

source: get brightness
fr: obtenir la luminosité

source: get the brightness of the ambient light
fr: obtenir la luminosité de la lumière ambiante

source: average color
fr: balance des couleurs

source: if set to 0 then color averaging is off during calibration; for other values it is on
fr: lorsque c'est 0, la balance des couleurs est désactivée pendant la calibration; pour les autres valeurs elle est activée

source: x position
fr: position en x

source: return x position
fr: retourne la position en x

source: y position
fr: position en y

source: return y position
fr: retourne la position en y

source: return the number of pixels of the biggest blob
fr: retourner le nombre de pixels du plus gros bout

source: set the color mode of the camera to RGB
fr: définit le mode couleur RGB pour la caméra

source: set the color mode of the camera to YUV
fr: définit le mode couleur YUV pour la caméra

source: set the color mode of the camera to HSV
fr: définit le mode couleur HSV pour la caméra

source: empty calibration
fr: calibration vide

source: error in string conversion
fr: erreur dans la conversion d'une chaîne de caractères

source: Pattern detection
fr: Détection de contour

source: Seeing signal
fr: Visualisation du signal

source: Returns True if the signal is in front of the camera
fr: Retourne Vrai si le signal est en face de la caméra

source: Distance to signal
fr: Distance au signal

source: Returns the distance of the signal to the camera in millimeters
fr: Retourne la distance du signal à la caméra en millimètres

source: speed SumBot
fr: vitesse SumBot

source: submit the speed to the SumBot
fr: envoyer la vitesse au SumBot

source: set the default speed for the movement commands
fr: fixe la vitesse par défaut pour les commandes de déplacement

source: forward SumBot
fr: avancer SumBot

source: move SumBot forward
fr: faire avancer le SumBot

source: backward SumBot
fr: reculer SumBot

source: move SumBot backward
fr: faire reculer le SumBot

source: stop SumBot
fr: arrêter le SumBot

source: stop the SumBot
fr: faire arrêter le SumBot

source: left SumBot
fr: SumBot à gauche

source: turn left the SumBot
fr: faire tourner le SumBot à gauche

source: right SumBot
fr: SumBot à droite

source: turn right the SumBot
fr: faire tourner le SumBot à droite

source: angle to center
fr: angle avec le centre

source: get the angle to the center of the dohyo
fr: obtenir l'angle avec le centre du dojo

source: angle to Enemy
fr: angle pour faire face à l'adversaire

source: get the angle to the Enemy
fr: obtenir l'angle par rapport à l'adversaire

source: get the x coordinate of the SumBot
fr: obtenir la coordonnée x du Sumbot

source: get the y coordinate of the SumBot
fr: obtenir la coordonnée y du Sumbot

source: x coor. Enemy
fr: x coor. adversaire

source: get the x coordinate of the Enemy
fr: obtenir la coordonnée x de l'adversaire

source: y coor. Enemy
fr: y coor. SumBot

source: get the y coordinate of the Enemy
fr: obtenir la coordonnée y de l'adversaire

source: get the rotation of the Sumbot
fr: obtenir la rotation de l'adversaire

source: rotation Enemy
fr: rotation adversaire

source: get the rotation of the Enemy
fr: obtenir la rotation de l'adversaire

source: distance to center
fr: distance par rapport au centre

source: get the distance to the center of the dohyo
fr: obtient la distance par rapport au centre du dojo

source: distance to Enemy
fr: distance à l'adversaire

source: get the distance to the Enemy
fr: obtient la distance par rapport à l'adversaire

source: update information
fr: actualise l'information

source: update information from the server
fr: actualise l'information depuis le serveur

source: Palette of physics blocks
fr: Palette de blocs physique

source: start polygon
fr: commence le polygone

source: add point
fr: ajoute un point

source: end polygon
fr: fin du polygone

source: end filled polygon
fr: fin du polygone plein

source: Not a simple polygon
fr: Pas un polygone simple

source: height
fr: hauteur

source: Add a triangle object to the project.
fr: Ajoute un objet triangle au projet.

source: circle
fr: cercle

source: width
fr: largeur

source: reset
fr: réinitialise

source: Reset the project; clear the object list.
fr: Réinitialise le projet ; efface la liste des objets.

source: motor
fr: moteur

source: torque
fr: couple

source: speed
fr: vitesse

source: Motor torque and speed range from 0 (off) to positive numbers; motor is placed on the most recent object created.
fr: Couple moteur et plage de vitesse de 0 (arrêt) à des valeurs positives ; le moteur est placé sur l'objet créé en dernier.

source: Pin an object down so that it cannot fall.
fr: Épingle un objet pour l'empêcher de tomber.

source: joint
fr: relie

source: Join two objects together (the most recent object created and the object at point x, y).
fr: Relie deux objets ensemble (l'objet créé en dernier et l'objet au point x, y).

source: save as Physics activity
fr: enregistrer comme une activité Physics

source: gear
fr: engrenage

source: Add a gear object to the project.
fr: Ajoute un objet engrenage au projet.

source: density
fr: densité

source: Set the density property for objects (density can be any positive number).
fr: Définit la propriété densité pour les objets (la densité peut être un nombre positif quelconque).

source: Set the friction property for objects (value from 0 to 1, where 0 turns friction off and 1 is strong friction).
fr: Définit la propriété friction pour les objets (valeur de 0 à 1, où 0 désactive la friction et 1 est une friction forte).

source: bounciness
fr: ressort

source: Set the bounciness property for objects (a value from 0 to 1, where 0 means no bounce and 1 is very bouncy).
fr: Définit la propriété ressort pour les objets (valeur de 0 à 1, où 0 est l'absence de ressort et 1 correspond à un ressort élevé).

source: dynamic
fr: dynamique

source: If dynamic = 1, the object can move; if dynamic = 0, it is fixed in position.
fr: Si dynamique = 1, l'objet peut se déplacer ; si dynamique = 0, il est fixé en position.

source: Palette of WeDo blocks
fr: Palette de blocs WeDo

source: set current WeDo device
fr: définit l'instrument WeDo actuel

source: number of WeDo devices
fr: nombre d'instruments WeDo

source: tilt
fr: inclinaison

source: distance sensor output
fr: sortie du capteur de distance

source: Motor A
fr: Moteur A

source: returns the current value of Motor A
fr: retourner la valeur actuelle du moteur A

source: Motor B
fr: Moteur B

source: returns the current value of Motor B
fr: retourner la valeur actuelle du moteur B

source: set the value for Motor A
fr: définir la valeur du moteur A

source: set the value for Motor B
fr: définir la valeur du moteur B

source: WeDo is unavailable
fr: WeDo n'est pas disponible

source: WeDo %d is unavailable; defaulting to 1
fr: WeDo %d n'est pas disponible; choix du 1 par défaut

source: %(device)s is unavailable on WeDo %(wedo_number)d
fr: %(device)s n'est pas disponible sur WeDo %(wedo_number)d"

source: Palette of LEGO NXT blocks of motors
fr: Palette de blocs LEGO NXT pour les moteurs

source: Palette of LEGO NXT blocks of sensors
fr: Palette de blocs LEGO NXT pour les capteurs

source: touch
fr: toucher

source: ultrasonic
fr: ultrason

source: color
fr: couleur

source: sound
fr: son

source: Please check the connection with the brick
fr: Merci de vérifier la connexion avec la brique

source: Invalid port '%s'. Port must be: PORT A, B or C
fr: Port '%s' invalide. Le port doit être: PORT A, B ou C

source: Invalid port '%s'. Port must be: PORT 1, 2, 3 or 4
fr: Port '%s' invalide. Le port doit être: PORT 1, 2, 3 ou 4"

source: The value of power must be between -127 to 127
fr: La valeur pour l'énergie doit être comprise entre -127 et 127

source: The parameter must be a integer, not '%s'
fr: Le paramètre doit être un entier, pas '%s'

source: An error has occurred: check all connections and try to reconnect
fr: Une erreur est survenue : vérifiez toutes les connexion et essayez de vous reconnecter

source: NXT found %s bricks
fr: NXT a trouvé %s briques

source: NXT not found
fr: NXT non trouvé

source: Brick number %s was not found
fr: La brique numéro %s n'a pas pu être trouvée

source: refresh NXT
fr: rafraîchir NXT

source: Search for a connected NXT brick.
fr: Recherche d'une brique NXT connectée.

source: set current NXT device
fr: définit l'instrument NXT courant

source: number of NXT devices
fr: nombre d'instrument NXT

source: brick name
fr: nom de la brique

source: Get the name of a brick.
fr: Obtenir le nom de la brique

source: play tone
fr: jouer une note

source: frequency
fr: fréquence

source: time
fr: temps

source: Play a tone at frequency for time.
fr: Jouer une note à cette fréquence pour une durée.

source: turn motor
fr: tourner le moteur

source: power
fr: puissance

source: turn a motor
fr: tourner un moteur

source: synchronize motors
fr: synchroniser moteurs

source: steering
fr: conduite

source: synchronize two motors connected in PORT B and PORT C
fr: synchroniser deux moteurs connectés aux ports B et C

source: PORT A of the brick
fr: PORT A de la brique

source: PORT B of the brick
fr: PORT B de la brique

source: PORT C of the brick
fr: PORT C de la brique

source: synchronize motors
fr: synchroniser moteurs

source: start motor
fr: Démarrer le moteur

source: Run a motor forever.
fr: Lancer un moteur pour toujours.

source: brake motor
fr: frein moteur

source: reset motor
fr: réinitialiser le moteur

source: motor position
fr: position du moteur

source: PORT 1 of the brick
fr: PORT 1 de la brique

source: read
fr: lire

source: sensor
fr: capteur

source: PORT 2 of the brick
fr: PORT 2 de la brique

source: light sensor
fr: capteur de lumière

source: gray sensor
fr: capteur gris

source: PORT 3 of the brick
fr: PORT 3 de la brique

source: touch sensor
fr: capteur tactile

source: distance sensor
fr: capteur de distance

source: PORT 4 of the brick
fr: PORT 4 de la brique

source: sound sensor
fr: capteur auditif

source: color sensor
fr: capteur de couleur

source: set light
fr: définir la lumière

source: Set color sensor light.
fr: Définir la luminosité du capteur de couleur.

source: battery level
fr: niveau de batterie

source: Get the battery level of the brick in millivolts
fr: Obtenir le niveau de la batterie de la brique en millivolts

source: Palette of Arduino blocks
fr: Palette de blocs Arduino

source: PWM
fr: MDL

source: ERROR: Check the Arduino and the number of port.
fr: ERREUR: Vérifiez l'Arduino et le numéro de port.

source: ERROR: Value must be a number from 0 to 255.
fr: ERREUR: La valeur doit être comprise entre 0 et 255.

source: ERROR: Value must be either HIGH or LOW, 0 or 1
fr: ERREUR: La valeur doit être soit HAUT soit BAS, 0 ou 1

source: ERROR: The mode must be either INPUT, OUTPUT, PWM or SERVO.
fr: ERREUR: Le mode doit être soit INPUT, OUTPUT, MDL ou SERVO.

source: ERROR: The value must be an integer.
fr: ERREUR : La valeur doit être un entier.

source: ERROR: The pin must be an integer.
fr: ERREUR ; Le pin doit être un entier.

source: refresh Arduino
fr: rafraîchir Arduino

source: Search for connected Arduinos.
fr: Recherche d'Arduinos connectés

source: set current Arduino board
fr: définit la carte Arduino courante

source: number of Arduinos
fr: nombre d'Arduinos

source: number of Arduino boards
fr: nombre de cartes Arduino

source: Arduino name
fr: nom de l'Arduino

source: Get the name of an Arduino.
fr: Obtenir le nom d'un Arduino.

source: analog write
fr: écriture analogique

source: Write analog value in specified port.
fr: Écrire la valeur analogique dans le port spécifié.

source: analog read
fr: Lecture analogique

source: digital write
fr: écriture digitale

source: Write digital value to specified port.
fr: Écrire la valeur digitale sur le port spécifié.

source: digital read
fr: lecture digitale

source: Read value from digital port.
fr: Lire la valeur d'un port digital.

source: Set HIGH value for digital port.
fr: Définir HAUT comme valeur du port digital.

source: Configure Arduino port for digital input.
fr: Configurer le port Arduino pour une entrée digitale.

source: Configure Arduino port to drive a servo.
fr: Configurer le port Arduino pour conduire un SERVO.

source: Configure Arduino port for digital output.
fr: Configurer le port Arduino pour la sortie digitale.

source: Configure Arduino port for PWM (pulse-width modulation).
fr: Configurer le port Arduino pour MDL (modulation de largeur).

source: Not found Arduino %s
fr: Arduino %s introuvable

source: The pin must be an integer
fr: Le pin doit être un entier

source: The device must be an integer
fr: Le périphérique doit être un entier

source: Palette of Expeyes blocks
fr: Palette de blocs Expeyes

source: set PVS
fr: définit PVS

source: set programmable voltage output
fr: définit une sortie de tension programmable

source: set SQR1 voltage
fr: définit la tension SQR1

source: set square wave 1 voltage output
fr: définit la sortie de tension de l'onde carrée 1

source: set SQR2 voltage
fr: définit la tension SQR2

source: set square wave 2 voltage output
fr: définit la sortie de tension de l'onde carrée 2

source: set OD1
fr: définit OD1

source: set digital output level (OD1) low (0) or high (1)
fr: définit le niveau de sortie digitale (OD1) bas (0) ou haut (1)

source: IN1 level
fr: niveau IN1

source: returns 1 if IN1 voltage level >2.5 volts, 0 if IN1 voltage level <= 2.5 volts
fr: renvoie 1 si le niveau de tension IN1 >2.5 volts, 0 si le niveau de tension IN1 <= 2.5 volts

source: IN2 level
fr: niveau IN2

source: returns 1 if IN2 voltage level >2.5 volts, 0 if IN2 voltage level <= 2.5 volts
fr: renvoie 1 si le niveau de tension IN2 >2.5 volts, 0 si le niveau de tension IN2 <= 2.5 volts

source: SEN level
fr: niveau SEN

source: returns 1 if resistive sensor (SEN) voltage level > 2.5 volts, 0 if SEN voltage level <= 2.5 volts
fr: renvoie 1 si la tension du capteur résistif (SEN) > 2.5, 0 si le niveau de tension SEN <= 2.5 volts

source: input
fr: entrée

source: samples
fr: exemples

source: interval
fr: intervalle

source: capture multiple samples from input at interval (MS); results pushed to FIFO
fr: capturer plusieurs exemples depuis l'entrée à l'intervale (MS); les résultats sont envoyés à FIFO

source: read analog input 1 voltage
fr: lire la tension d'entrée analogique 1

source: read analog input 2 voltage
fr: lire la tension d'entrée analogique 2

source: read input 1 voltage
fr: lire la tension de l'entrée 1

source: read input 2 voltage
fr: lire la tension de l'entrée 2

source: read analog sensor input voltage
fr: lire la tension d'entrée du capteur analogique

source: read square wave 1 voltage
fr: lit la sortie de tension de l'onde carrée 1

source: read square wave 2 voltage
fr: lit la sortie de tension de l'onde carrée 2

source: read programmable voltage
fr: lire la tension programmable

source: Expeyes device not found
fr: Instrument Expeyes non trouvé

source: resume playing video or audio
fr: reprendre la lecture vidéo ou audio

source: Title
fr: Titre

source: Average RGB color from camera is pushed to the stack
fr: La couleur RVB moyenne de la caméra est poussée sur la pile

source: yellow
fr: jaune

source: displays polar coordinates
fr: afficher les coordonnées polaires

source: emptys FILO (first-in-last-out heap)
fr: vider FILO (Premier Entrée Dernier Sortie)

source: camera output
fr: sortie de la caméra

source: push acceleration in x, y, z to heap
fr: pousse l'accélération sur x, y, z sur le tas

source: if-then operator that uses boolean operators from Numbers palette
fr: opérateur si-alors utilisant des opérateurs booléens de la palette des nombres

source: jogs stack right
fr: pousse la pile à droite

source: Sugar Journal media object
fr: Objet média du Journal Sugar

source: box 2
fr: boîte 2

source: box 1
fr: boîte 1

source: Step
fr: Pas à pas

source: multiplies two numeric inputs
fr: multiplie deux valeurs numériques

source: Show/hide blocks
fr: Montrer/Cacher les blocs
