Repository: sugar-activities/4682-activity
Catalog: po/*.po
Languages: fr

source: Hide palette
fr: Masquer la palette

source: Buddies
fr: Amis

source: My Turtle Art session
fr: Ma session ArtTortue

source: Sugar Journal video object
fr: Objet vidéo du Journal Sugar

source: xcor of right of screen
fr: coord. x de la droite de l'écran

source: Palette of extra options
fr: Palette d'options supplémentaires

source: move all blocks to trash
fr: déplacer tous les blocs vers la corbeille

source: list
fr: liste

source: Configuration directory not writable: %s
fr: Répertoire de configuration non inscriptible : %s

source: media resume
fr: reprendre le média

source: heading
fr: cap

source: Sharing blocks disabled
fr: Partage de blocs désactivé

source: saves turtle graphics as an SVG file in the Sugar Journal
fr: enregistre les dessins de la tortue en tant que fichier SVG dans le Journal de Sugar

source: draws text or show media from the Journal
fr: dessine un texte ou montre un média du Journal

source: video
fr: vidéo

source: blue
fr: bleu

source: No option action:
fr: Aucune action d'option :

source: jogs stack down
fr: pousse l'action en bas

source: modular (remainder) operator
fr: opérateur modulaire (reste)

source: bottom y
fr: bas x

source: save SVG
fr: enregistrer SVG

source: runs code found in the tamyblock.py module found in the Journal
fr: exécute le code trouvé dans le module tamyblock.py module du Journal

source: pen down
fr: crayon abaissé

source: wait
fr: attend

source: box
fr: boîte

source: Failed to upload!
fr: Echec du transfert !

source: shift
fr: tourner

source: invokes named action stack
fr: invoque la pile d'actions nommée

source: do-until-True operator that uses boolean operators from Numbers palette
fr: opérateur faire-tantQue-Vrai utilisant des opérateurs booléens de la palette des nombres

source: usage is
fr: l'usage est

source: Variable 2 (numeric value)
fr: Variable 2 (valeur numérique)

source: divide
fr: diviser

source: picture name
fr: nom image

source: while
fr: tant que

source: the canvas width
fr: largeur du canevas

source: empty heap?
fr: tas vide ?

source: named variable (numeric value)
fr: variable nommée (valeur numérique)

source: next
fr: suivant

source: if then
fr: si alors

source: set pen size
fr: fixe l'épaisseur du trait

source: presentation template: select Journal object (no description)
fr: modèle de présentation : sélectionner un objet du Journal (sans description)

source: until
fr: jusqu'à

source: media stop
fr: arrêt média

source: Turn on hover help
fr: Activer les info-bulles

source: permanently deletes items in trash
fr: effacer de manière définitive les objets dans la corbeille

source: uturn
fr: Demi-tour

source: top of Action 1 stack
fr: haut de la pile Action 1

source: a programmable block: used to add advanced single-variable math equations, e.g., sin(x)
fr: un bloc programmable: utilisé pour ajouter des équations mathématiques avancées à une seule variable, ex: sin(x)

source: Palette of flow operators
fr: Palette d'opérateurs de flux

source: top of a collapsed stack
fr: haut d'une pile agrégée

source: if-then-else operator that uses boolean operators from Numbers palette
fr: opérateur si-alors-sinon utilisant des opérateurs booléens de la palette des nombres

source: returns mouse y coordinate
fr: retourne la coordonnée y de la souris

source: holds current pen shade
fr: conserver l'ombre courante du stylo

source: sinewave
fr: onde sinusoïdale

source: Login failed
fr: Echec de la connexion

source: left x
fr: gauche x

source: set heading
fr: seth

source: RGB color under the turtle is pushed to the stack
fr: La couleur RVB sous la tortue est poussée vers la pile

source: declutters canvas by hiding blocks
fr: désencombre le canevas en masquant les blocs

source: Python chr operator
fr: opérateur Python chr

source: horizontal space
fr: espacement horizontal

source: Metric coordinates
fr: Coordonnées métriques

source: string value
fr: valeur chaîne

source: I don't know how to
fr: Je ne sais pas comment faire pour

source: Username:
fr: Identifiant :

source: starts filled polygon (used with end fill block)
fr: commence le polygone rempli (utilisé avec arrête le remplissage du bloc)

source: presentation template: select four Journal objects
fr: modèle de présentation : sélectionner quatre objets du Journal

source: View
fr: Vue

source: sets gray level of the line drawn by the turtle
fr: définit le niveau de gris de la ligne dessinée par la tortue

source: Password:
fr: Mot de passe :

source: turtle sees
fr: tortue voit

source: stop action
fr: arrête l'action

source: green
fr: vert

source: shade
fr: teinte

source: fills the background with (color, shade)
fr: remplit l'arrière plan (couleur, teinte)

source: save picture
fr: enregistrer image

source: pitch
fr: hauteur

source: returns 1 if mouse button is pressed
fr: retourne 1 si le bouton de la souris est actionné

source: Rescale coordinates up
fr: Augmenter l'échelle des coordonnées

source: pen up
fr: crayon levé

source: pauses program execution a specified number of seconds
fr: met en pause l'exécution du programme pendant un nombre spécifié de secondes

source: pushes value onto FILO (first-in last-out heap)
fr: pousse la valeur dans le tas FILO (premier entré dernier sorti)

source: clear all
fr: effacer tout

source: then
fr: alors

source: Register
fr: S'enregistrer

source: not
fr: non

source: if then else
fr: si alors sinon

source: stops current action
fr: arrêter l'action courante

source: turns turtle clockwise (angle in degrees)
fr: pivoter la tortue dans le sens horaire (angle en degrés)

source: holds current gray level (can be used in place of a number block)
fr: maintient le niveau de gris courant (utilisable à la place d'un bloc numérique)

source: xcor of left of screen
fr: coord. x de la gauche de l'écran

source: Reset block size
fr: Réinitialiser taille blocs

source: turtle
fr: tortue

source: displays next palette
fr: affiche la palette suivante

source: hide blocks
fr: masquer les blocs

source: light level detected by camera
fr: niveau de luminosité détecté par la caméra

source: Python int operator
fr: opérateurs Python int

source: logical less-than operator
fr: opérateur logique plus petit que

source: restore all blocks from trash
fr: restaurer tous les blocs de la poubelle

source: Save
fr: Enregistrer

source: store in box 1
fr: range dans la boîte 1

source: store in box 2
fr: range dans la boîte 2

source: hides the Sugar toolbars
fr: cacher la barre d'outils Sugar

source: holds current x-coordinate value of the turtle (can be used in place of a number block)
fr: maintient la valeur de la coordonnée x courante de la tortue (utilisable à la place d'un bloc numérique)

source: print
fr: montre

source: returns mouse x coordinate
fr: retourne la coordonnée x de la souris

source: red
fr: rouge

source: Save as Logo
fr: Enregistrer en Logo

source: sets color of the line drawn by the turtle
fr: définit la couleur de la ligne dessinée par la tortue

source: loudness
fr: volume

source: Enable collaboration
fr: Activer la collaboration

source: Palette of sensor blocks
fr: Palette de blocs de capteurs

source: returns True if mouse button is pressed
fr: retourne Vrai si le bouton de la souris est actionné

source: number
fr: nombre

source: query keyboard
fr: interroger clavier

source: top
fr: haut

source: Submit to Web
fr: Publier sur le Web

source: Nickname
fr: Pseudo

source: set scale
fr: définit l'échelle

source: Share selected blocks
fr: Partager les blocs sélectionnés

source: white
fr: blanc

source: connects action to toolbar run buttons
fr: connecte l'action aux boutons exécuter de la barre d'outils

source: elapsed time (in seconds) since program started
fr: temps écoulé (en secondes) depuis le démarrage du programme

source: Cancel
fr: Annuler

source: the canvas height
fr: hauteur du canevas

source: minus
fr: moins

source: and
fr: et

source: top of a collapsible stack
fr: haut d'une pile à agréger

source: as input
fr: comme entrée

source: Python block
fr: Bloc Python

source: media wait
fr: attente du média

source: acceleration
fr: accélération

source: holds current pen size (can be used in place of a number block)
fr: maintient la taille courante du trait (utilisable à la place d'un bloc numérique)

source: set color
fr: fixe la couleur

source: loads a block
fr: charge un bloc

source: Palette of pen commands
fr: Palette de commandes stylet

source: shows values in FILO (first-in last-out heap)
fr: affiche les valeurs dans le tas FILO (premier entré dernier sorti)

source: do-while-True operator that uses boolean operators from Numbers palette
fr: opérateur faire-tantQue-Vrai utilisant des opérateurs booléens de la palette des nombres

source: File
fr: Fichier

source: logical NOT operator
fr: opérateur logique NON

source: ycor of bottom of screen
fr: coord. y du bas de l'écran

source: presentation template: select Journal object (with description)
fr: modèle de présentation : sélectionner un objet du Journal (avec sa description)

source: Palette of numeric operators
fr: Palette d'opérateurs numériques

source: multiply
fr: multiplier

source: forever
fr: toujours

source: Plugin %s already installed.
fr: Le module %s est déjà installé.

source: sets shade of the line drawn by the turtle
fr: définit la teinte de la ligne dessinée par la tortue

source: speaks text
fr: dit le texte

source: snapshot
fr: instantanée

source: clean
fr: efface

source: presentation template: select two Journal objects
fr: modèle de présentation : sélectionner deux objets du Journal

source: Grow blocks
fr: Augmenter les blocs

source: Fullscreen
fr: Plein écran

source: File not found
fr: Fichier introuvable

source: show
fr: montre

source: text
fr: texte

source: random
fr: aléatoire

source: logical greater-than operator
fr: opérateur logique plus grand que

source: turns turtle counterclockwise (angle in degrees)
fr: pivoter la tortue dans le sens anti-horaire (angle en degrés)

source: black
fr: noir

source: calculates square root
fr: calcule la racine carrée

source: holds current y-coordinate value of the turtle (can be used in place of a number block)
fr: maintient la valeur de la coordonnée y courante de la tortue (utilisable à la place d'un bloc numérique)

source: mouse x
fr: souris x

source: mouse y
fr: souris y

source: stop
fr: arrête

source: greater than
fr: plus grand que

source: xcor
fr: coord x

source: Help
fr: Aide

source: Save project?
fr: Sauvegarder le projet ?

source: chooses which turtle to command
fr: choisir la tortue à commander

source: right x
fr: droite x

source: light level detected by light sensor
fr: niveau de luminosité détecté par le capteur de luminosité

source: keyboard
fr: clavier

source: radius
fr: rayon

source: set shade
fr: fixe la teinte

source: logical AND operator
fr: opérateur logique ET

source: You must have an account at http://turtleartsite.sugarlabs.org to upload your project.
fr: Vous devez avoir un compte sur http://turtleartsite.sugarlabs.org pour transférer votre projet.

source: Run
fr: Exécuter

source: show heap
fr: affiche le tas

source: sets the heading of the turtle (0 is towards the top of the screen.)
fr: fixe le cap de la tortue (0 est orienté sur le haut de l'écran)

source: microphone input volume
fr: volume d'entrée du micro

source: Title:
fr: Titre :

source: Palette of media objects
fr: Palette d'objets multimédia

source: Restore blocks from trash
fr: Restaurer tous les blocs de la poubelle

source: Palette of variable blocks
fr: Palette de blocs variables

source: used as numeric input in mathematic operators
fr: utilisé comme valeur numérique des opérateurs mathématiques

source: Upload
fr: Transférer

source: Server
fr: Serveur

source: Variable 1 (numeric value)
fr: Variable 1 (valeur numérique)

source: Neighborhood
fr: Voisinage

source: adds two alphanumeric inputs
fr: ajoute deux valeurs alphanumériques

source: equal
fr: égal

source: else
fr: sinon

source: doesn't like
fr: n'aime pas

source: You have unsaved work. Would you like to save before quitting?
fr: Vous n'avez pas sauvegardé votre travail. Voulez-vous le sauvegarder avant de quitter ?

source: restores hidden blocks
fr: restaurer les blocs cachés

source: stop video or audio
fr: arrêter la vidéo ou l'audio

source: Turtle will not draw when moved.
fr: La tortue ne dessinera pas lorsqu'elle sera déplacée.

source: pop
fr: dépile

source: pen size
fr: épaisseur du trait

source: turtle shell
fr: carapace de la tortue

source: plays a sinewave at frequency, amplitude, and duration (in seconds)
fr: joue une onde sinusoïdale à une fréquence, une amplitude et une durée (en secondes)

source: speak
fr: parler

source: read value from RFID device
fr: lire la valeur de l'équipement RFID

source: moves turtle along an arc
fr: déplacer la tortue le long d'un arc

source: logical equal-to operator
fr: opérateur logique égale

source: Palette of pen colors
fr: Palette de couleur du stylo

source: pause video or audio
fr: mettre la vidéo ou l'audio en pause

source: stores numeric value in Variable 1
fr: stocke une valeur numérique dans la Variable 1

source: stores numeric value in Variable 2
fr: stocke une valeur numérique dans la Variable 2

source: put a custom 'shell' on the turtle
fr: place une 'carapace' personnalisée sur la tortue

source: button down
fr: bouton enfoncé

source: moves turtle backward
fr: reculer la tortue

source: ycor of top of screen
fr: coord. y du haut de l'écran

source: Show blocks
fr: Afficher les blocs

source: play
fr: jouer

source: save
fr: enregistrer

source: Colors
fr: Couleurs

source: sets size of the line drawn by the turtle
fr: définit l'épaisseur de la ligne dessinée par la tortue

source: Open
fr: Ouvrir

source: ycor
fr: coord y

source: a programmable block: used to add advanced multi-variable math equations, e.g., sqrt(x*x+y*y)
fr: un bloc programmable: utilisé pour ajouter des équations mathématiques avancées à plusieurs variables, ex: sqrt(x*x+y*y)

source: if
fr: si

source: moves turtle to position xcor, ycor; (0, 0) is in the center of the screen.
fr: déplace la tortue sur la position xcor, ycor; (0, 0) correspond au centre de l'écran.

source: Stop
fr: Arrêter

source: end fill
fr: arrête le remplissage

source: Copy
fr: Copier

source: Paste
fr: Coller

source: did not output to
fr: n'a pas pu ouvrir

source: Activities
fr: Activités

source: Upload to Web
fr: Transférer vers le Web

source: empty heap
fr: vide le tas

source: pops value off FILO (first-in last-out heap)
fr: sort la valeur du tas FILO (premier entré dernier sorti)

source: Clean
fr: Effacer

source: Palette of presentation templates
fr: Palette de modèles de présentation

source: identity
fr: identité

source: Save/Load
fr: Enregistrer/Charger

source: top y
fr: haut x

source: Tools
fr: Outils

source: comment
fr: commenter

source: subtracts bottom numeric input from top numeric input
fr: soustrait la valeur numérique inférieure de la valeur numérique supérieure

source: media pause
fr: pause média

source: query for keyboard input (results stored in keyboard block)
fr: interroge la valeur entrée au clavier (résultat stocké dans le bloc clavier)

source: Cartesian
fr: Cartésienne

source: clears the screen and reset the turtle
fr: effacer l'écran et réinitialiser la tortue

source: raw microphone input signal
fr: signal d'entrée micro brut

source: returns the color that the turtle "sees"
fr: retourne la couleur "vue" par la tortue

source: invokes Action 1 stack
fr: invoque la pile d'actions 1

source: Palette of turtle commands
fr: Palette de commandes Tortue

source: loops forever
fr: boucle infinie

source: show aligned
fr: montrer alignement

source: Do you want to reinstall %s?
fr: Voulez-vous réinstaller %s ?

source: Project
fr: Projet

source: Debug
fr: Débogage

source: Turn off hover help
fr: Désactiver les info-bulles

source: Password
fr: Mot de passe

source: vertical space
fr: espacement vertical

source: completes filled polygon (used with start fill block)
fr: complète le polygone rempli (utilisé avec commence le remplissage du bloc)

source: Share
fr: Partager

source: less than
fr: plus petit que

source: square root
fr: racine carré

source: Rescale coordinates
fr: Modifier l'échelle

source: show blocks
fr: montrer blocs

source: Quit
fr: Quitter

source: Sugar Journal description field
fr: Champ description du Journal Sugar

source: set gray
fr: fixe gris

source: presentation bulleted list
fr: présentation liste à puce

source: duration
fr: durée

source: New
fr: Nouveau

source: places a comment in your code
fr: placer un commentaire dans votre code

source: read pixel
fr: lire le pixel

source: scale
fr: échelle

source: bottom
fr: bas

source: purple
fr: pourpre

source: Rescale coordinates down
fr: Diminuer l'échelle des coordonnées

source: click to open
fr: cliquer pour ouvrir

source: microphone input pitch
fr: pitch d'entrée du micro

source: empty trash
fr: vider la corbeille

source: Turtle will draw when moved.
fr: La tortue dessinera quand elle sera déplacée.

source: Load...
fr: Charger...

source: Sugar Journal audio object
fr: Objet audio du Journal Sugar

source: Stop turtle
fr: Arrêter la tortue

source: Turtle
fr: Tortue

source: changes the orientation of the palette of blocks
fr: change l'orientation de la palette des blocs

source: store in
fr: enregistre

source: Hide blocks
fr: Masquer les blocs

source: or
fr: ou

source: presentation template: list of bullets
fr: modèle de présentation : liste de puces

source: identity operator used for extending blocks
fr: opérateur d'identité utilisé pour les blocs d'extension

source: Shrink blocks
fr: Diminuer les blocs

source: holds current heading value of the turtle (can be used in place of a number block)
fr: maintient la valeur du cap courant de la tortue (utilisable à la place d'un bloc numérique)

source: returns random number between minimum (top) and maximum (bottom) values
fr: retourne le nombre aléatoire compris entre les valeurs minimum (en haut) et maximum (en bas)

source: holds current pen color (can be used in place of a number block)
fr: maintient la couleur courante du trait (utilisable à la place d'un bloc numérique)

source: Show palette
fr: Afficher la palette

source: saves a picture to the Sugar Journal
fr: enregistre l'image dans le Journal de Sugar

source: Save snapshot
fr: Enregistrer l'instantané

source: start
fr: commencer

source: returns True if heap is empty
fr: renvoie Vrai si le tas est vide

source: moves turtle forward
fr: avancer la tortue

source: forward
fr: avance

source: my box
fr: ma boite

source: Account ID
fr: ID de compte

source: Select blocks to share
fr: Sélectionner les blocs à partager

source: back
fr: recule

source: sets the scale of media
fr: fixe l'échelle du média

source: holds current scale value
fr: conserver la valeur actuelle de l'échelle

source: top of nameable action stack
fr: haut de l'action nommable

source: stores numeric value in named variable
fr: stocke une valeur numérique dans la variable nommée

source: logical OR operator
fr: opérateur logique OU

source: microphone input voltage
fr: tension d'entrée du micro

source: loops specified number of times
fr: boucle un certain nombre de fois

source: Save...
fr: Enregistrer...

source: invokes Action 2 stack
fr: invoque la pile d'actions 2

source: setxy
fr: fixe xy

source: title y
fr: titre y

source: title x
fr: titre x

source: fill screen
fr: peint le fond

source: Save as
fr: Enregistrer sous

source: set xy
fr: fixe xy

source: trash
fr: corbeille

source: polar
fr: polaire

source: repeat
fr: répète

source: wait for current video or audio to complete
fr: attendre la fin de la vidéo ou de l'audio en cours

source: Save as image
fr: Enregistrer dans une image

source: Edit
fr: Édition

source: microphone input resistance
fr: résistance d'entrée du micro

source: top of Action 2 stack
fr: haut de la pile Action 2

source: divides top numeric input (numerator) by bottom numeric input (denominator)
fr: divise la valeur numérique supérieure (numérateur) par la valeur numérique inférieure (dénominateur)

source: prints value in status block at bottom of the screen
fr: affiche la valeur dans le bloc d'état en bas de l'écran

source: start fill
fr: commence le remplissage

source: holds results of query-keyboard block as ASCII
fr: conserve le résultat dans le bloc clavier d'interrogation

source: push
fr: pousse

source: a programmable block: used to add advanced multi-variable math equations, e.g., sin(x+y+z)
fr: un bloc programmable: utilisé pour ajouter des équations mathématiques avancées à plusieurs variables, ex: sin(x+y+z)

source: restore all
fr: restaurer tout

source: hello
fr: salut

source: TurtleBlocks
fr: BlocsTortue

source: A Logo-inspired turtle that draws colorful pictures with snap-together visual programming blocks
fr: Une tortue inspirée par le langage Logo, qui dessine des dessins colorés à l'aide de blocs de programmation visuelle emboîtables.

source: pen down?
fr: crayon abaissé ?

source: returns True if pen is down
fr: renvoie Vrai si le crayon est abaissé

source: Please hit the Stop Button before making changes to your Turtle Blocks program
fr: Actionne le bouton Arrêter avant de modifier ton programme BlocsTortue

source: Save stack
fr: Enregistrer la pile

source: Really overwrite stack?
fr: Voulez-vous réellement remplacer la pile ?

source: Overwrite stack
fr: Remplacer la pile

source: Delete stack
fr: Supprimer la pile

source: Really delete stack?
fr: Voulez-vous réellement supprimer la pile ?

source: Facebook wall post
fr: Publication sur le mur Facebook

source: active turtle
fr: activer la tortue

source: the name of the active turtle
fr: nom de la tortue artive

source: load
fr: charger

source: selects a palette
fr: sélectionne a palette

source: Palette of user-defined operators
fr: Palette des opérateurs personnalisés

source: Please install the Speak Activity and try again.
fr: Installe l'activité Parler et essaie à nouveau

source: Spanish
fr: Espagnol

source: English
fr: Anglais

source: Sorry, I can't understand what you are asking about.
fr: Pardon, je ne comprends pas ce que tu demandes.

source: Sorry, there is no free memory to load my brain. Close other activities and try once more.
fr: Pardon, il n'y a pas de mémoire libre pour charger mon cerveau. Ferme les autres activités et essaie à nouveau.

source: push destination rgb value to heap
fr: pousse la valeur rvb cible sur la pile

source: other
fr: autre

source: turns the turtle 180 degrees
fr: Fait faire un virage de 180 degrés à la tortue

source: Show sample projects
fr: Montrer les projets exemple

source: Hide sample projects
fr: Masquer les projets exemple

source: About...
fr: À propos de...
