Repository: sugar-activities/4682-activity
Catalog: po/pbs.po
Languages: pbs

source: Turtle Art
pbs: Kumú' majau matsjau

source: Turtle Art Mini
pbs: Tortugarte Chich´i´

source: Turtle Confusion
pbs: Tortugarte mep muonu´u

source: Select a challenge
pbs: vixa´aun t´i´ieje´ manatsjau

source: Palette of Mexican pesos
pbs: Nijañg lumeitameiñ vu´us skiñing

source: Palette of Colombian pesos
pbs: Nijang lumei tameiñ colombianos

source: Palette of Rwandan francs
pbs: Nijang ne Francos de Ruanda

source: Palette of US dollars
pbs: Ninjang lumei tameiñ Kulujem

source: Palette of Australian dollars
pbs: Nijanglumei tameiñ Australianos

source: Palette of Paraguayan Guaranies
pbs: Nijang reGuaraníes Paraguayos

source: Palette of Peruvian Nuevo Soles
pbs: Nijang vinkjiu kunju´Peruanos

source: Palette of Uruguayan Pesos
pbs: Nijang tameiñ Uruguayos

source: TurtleBots
pbs: Turtkle Bots

source: returns the temperature
pbs: vikiep´ mapaa

source: returns 1 when the sensors detects a magnetic field, 0 otherwise
pbs: vikiep´1 xi´iap ne sonsor vakeje nda

source: button
pbs: ndaleiñ

source: light
pbs: majaap

source: temperature
pbs: mapaa

source: distance
pbs: kuba´ap

source: resistance
pbs: ne se lu'ujuñ manajap xikich'

source: voltage
pbs: xikich' manajap

source: Butia Robot
pbs: leechipiá Butia

source: refresh Butia
pbs: manamva´an Butiá

source: refresh the state of the Butia palette and blocks
pbs: Vimiejep viñkjiu ne nínjang re blok Butiá

source: battery charge Butia
pbs: manamejep´nguniang nagun´iag Butia

source: returns the battery charge in volts. If no motors present, it returns 255
pbs: vikiep´ne manajap ngun´iag Butia ne leechipiá ne nave´en 0 maoin 255

source: speed Butia
pbs: matau Butiá

source: left
pbs: meje'ep

source: right
pbs: majaap

source: stop Butia
pbs: ndama' ai Butia

source: stop the Butia robot
pbs: vimia´aik ne leechipia Butiá

source: forward Butia
pbs: matau Butiá

source: move the Butia robot forward
pbs: vikia´aut ne lecheepiá Butia ma katau

source: left Butia
pbs: ma maje´ep Batiá

source: turn the Butia robot at left
pbs: vikia´t ne lee chipiá Butia ma maje´ep

source: right Butia
pbs: kuas Butiá

source: turn the Butia robot at right
pbs: vikia´t ne lee chipia Butia ma majap

source: backward Butia
pbs: ma ngupex Butia

source: move the Butia robot backward
pbs: vikia´ autma majap ne leechiapia Butia ma ngupex

source: mode
pbs: mod

source: value
pbs: liñjú

source: calibration
pbs: ndakjaik

source: brightness
pbs: vanjial'

source: x position
pbs: vimia´ai x

source: return x position
pbs: vikiet´i kimia´ai x

source: y position
pbs: vimia´ai y

source: return y position
pbs: vikiet peuk se kimiag nama´ai

source: pixels
pbs: pixeles

source: return the number of pixels of the biggest blob
pbs: vikiet ne nave´ne pixeles

source: set the color mode of the camera to RGB
pbs: establece modo de color de nadake´eñ leet RGB

source: set the color mode of the camera to YUV
pbs: establece el modo de color ne ndake´eñ leet YUV

source: set the color mode of the camera to HSV
pbs: establece el modo de xikjia´de ne ndakeiñ leet HSV

source: empty calibration
pbs: kalibracion mu´uu

source: error in string conversion
pbs: karep´kujuiy de liñ´ajaui ne cadena de rin´ja

source: Distance to signal
pbs: kuba´ap señal

source: speed SumBot
pbs: matau SumBot

source: submit the speed to the SumBot
pbs: satea ne matau SumBot

source: set the default speed for the movement commands
pbs: satea matau defecto par re comandos de likiu´k

source: forward SumBot
pbs: makutau SumBot

source: move SumBot forward
pbs: vikia´aut ne SumBot ma kutau

source: backward SumBot
pbs: ma ngupesh Sumbot

source: move SumBot backward
pbs: vi´kia´aut ne SumBot ma ngpesh

source: stop SumBot
pbs: ma lama´aiy SumBot

source: stop the SumBot
pbs: malama ´aiy SumBot

source: left SumBot
pbs: ma majeep SumBot

source: turn left the SumBot
pbs: viljiañk SumBot ma maje´ep´

source: right SumBot
pbs: kuas SumBot

source: turn right the SumBot
pbs: viljiañk´ne SumBot ma majap

source: angle to center
pbs: angulo ne kingipe´

source: get the angle to the center of the dohyo
pbs: kijit ne angulo kingiep´ne dohyo

source: angle to Enemy
pbs: angulo ne mi´iip´

source: get the angle to the Enemy
pbs: kijit n ne angulo ne mi´iip´

source: x coor. SumBot
pbs: coor. x SumBot

source: get the x coordinate of the SumBot
pbs: kijit ne coordenada x de SumBot

source: y coor. SumBot
pbs: coor. y SumBot

source: get the y coordinate of the SumBot
pbs: kijit ne coordenada i de SumBot

source: x coor. Enemy
pbs: coor. x mi´iip´

source: get the x coordinate of the Enemy
pbs: kijit ne coordenada x ne mi´iip´

source: y coor. Enemy
pbs: coor. y mi´iip´

source: get the y coordinate of the Enemy
pbs: kijit ne coordenada i ne mi´iip´

source: rotation SumBot
pbs: liñ´jañ´SumBot

source: get the rotation of the Sumbot
pbs: kijit liñjañ he SumBot

source: rotation Enemy
pbs: liñ´jañ´mi´iip´

source: get the rotation of the Enemy
pbs: kijit ne liñ´jañ´ ne mi´iip´

source: distance to center
pbs: kupaá au re kingiep´

source: get the distance to the center of the dohyo
pbs: kijit re kupa´au ne kingiep´de dohyo

source: distance to Enemy
pbs: kupa´au ne mi´iip´

source: get the distance to the Enemy
pbs: kijit re kupa´au ne mi´iip´

source: update information
pbs: actualizar riñ´ja

source: update information from the server
pbs: actualizar re riñ´ja desde el servidor

source: Palette of physics blocks
pbs: Nijang se lumei re me'ets kily'e lu'uei vani'at matsjau

source: start polygon
pbs: manapup´nda poligono

source: Begin defining a new polygon based on the current Turtle xy position.
pbs: vipiup´main nda vingijiu poligono ki´iust peuk se ma´ai chuk manei xy ne kumuk´

source: add point
pbs: lamjep´nda punto

source: Add a new point to the current polygon based on the current Turtle xy position.
pbs: lamjep nda vingijiu ounto al poligono ki´iust peuk se ma´ai chuk manei xy ne kumuk´

source: end polygon
pbs: lamañk´poligono

source: Define a new polygon.
pbs: main nda vingi´jiu poligono

source: end filled polygon
pbs: vama´iñ

source: Not a simple polygon
pbs: nip napú nda viñjiu poligono

source: Define a new filled polygon.
pbs: vumang nda viñjiu poligono

source: triangle
pbs: ranju´umú

source: base
pbs: mimviup

source: Add a triangle object to the project.
pbs: mamejep nda sania´ranju´u mu ne ngul´ajau ndimjiuly´

source: circle
pbs: ndimjuily´

source: Add a circle object to the project.
pbs: mamejep nda sania ndimjiuly ne ngul´ajau

source: rectangle
pbs: kiñui muu

source: Add a rectangle object to the project.
pbs: mamejep nda sania kiñui muu nui man au nui mamaja´a

source: reset
pbs: maets peuk ndaei ndatsjau

source: Reset the project; clear the object list.
pbs: maets peuk maei matsjau ne ngul´ajau. nichi iñ´ne se ke´echlik´jiun re sad_ia manajap

source: motor
pbs: manajap

source: speed
pbs: ndakju´u

source: Motor torque and speed range from 0 (off) to positive numbers; motor is placed on the most recent object created.
pbs: El torque maiñ ndakju´u ne manajap nimviu ke nama 0. (mapung) rab-e´n majap ne na´va lumei ne sania´a matsjau em viñjiu

source: Pin an object down so that it cannot fall.
pbs: liña´ja nda sania par ke nip matsuj´u

source: joint
pbs: liviun´

source: Join two objects together (the most recent object created and the object at point x, y).
pbs: liviuch´nui sania´a ( ne sania´a matsjau mas vinjiu maiñ ne sania´a ndanú x, y)

source: save as Physics activity
pbs: makjat nkjai ndatsjau nadakjat

source: Save the project to the Journal as a Physics activity.
pbs: lukjuat ne nqui´aajau xiñi´u ngjaik nda ndatsjau ndakja´t

source: gear
pbs: Ndimjiuly

source: Add a gear object to the project.
pbs: lamejep nda sania´a ne ngul´ajau

source: density
pbs: vapu

source: Set the density property for objects (density can be any positive number).
pbs: Skad-a vakjaa ne vapu ne sania´a vapu mananiát latsjau neukse nab-én majau

source: friction
pbs: vupai

source: Set the friction property for objects (value from 0 to 1, where 0 turns friction off and 1 is strong friction).
pbs: skad- a ma´in ne vapui mana´jap re sad-ía (nda ndiñjiup kiñgyiep 0 y 1 peuk 0 ni kanen manajap y ne nda manajat)

source: bounciness
pbs: makeen

source: Set the bounciness property for objects (a value from 0 to 1, where 0 means no bounce and 1 is very bouncy).
pbs: skad- a ma´in ne vapai par sad-ia (nda ndiñjiup kiñyiep 0 y 1 peuk 0 va´ejei´nin lumei y nda nalei)

source: dynamic
pbs: majaut

source: If dynamic = 1, the object can move; if dynamic = 0, it is fixed in position.
pbs: majaut =1, nda sania mananiat laka´ut; si majau ngjaik 0 lijiañ skad-a. ma´i

source: Palette of WeDo blocks
pbs: Nijang se lumei re me'ets kily'e lu'uei vani'at matsjau

source: tilt sensor output: (-1 == no tilt, 0 == tilt forward, 3 == tilt back, 1 == tilt left, 2 == tilt right)
pbs: nadalejeñ ne nda´ujuñiñkie libits (-1==nip ndib-its, 0==lib-its ma kutau 3==lib-its ma ngupe ex, 1==lib-its ma maje´p2== lub-its ma majap)

source: distance sensor output
pbs: ndale´je iñ ne nda´ujuñ ni kubaap

source: Motor A
pbs: manájap A

source: returns the current value of Motor A
pbs: viñjiu ne manajap A

source: Motor B
pbs: manája B

source: returns the current value of Motor B
pbs: makep ne liñju viñiu ne manajap B

source: set the value for Motor A
pbs: setea ne liñju viñjiu ne manajap A

source: set the value for Motor B
pbs: setea ne liñju viñjiu ne manajap B

source: Palette of LEGO NXT blocks of motors
pbs: nijian se lumei re me´ets kily´e lu´uei vani´at matsjau manájap

source: Palette of LEGO NXT blocks of sensors
pbs: nijian se lumei re me´ets kily´e lu´uei vani´at matsjau ninkie

source: touch
pbs: va-d-usp

source: ultrasonic
pbs: kub-áp

source: color
pbs: xikjia'

source: sound
pbs: lijiu

source: Please check the connection with the brick
pbs: kichjia´ut majau ñut ne nda usx lon ne bkick

source: An error has occurred: check all connections and try to reconnect
pbs: nda ndich´iu nichjiau ñut mi´ia re nda´uik y ch´ut vumiand

source: NXT found %s bricks
pbs: NTX maka´je %s bricks

source: NXT not found
pbs: NTX nip make´je

source: refresh NXT
pbs: mambañ NTX

source: Search for a connected NXT brick.
pbs: mata´u pornnda brik NTX mamañg

source: NXT
pbs: NTX

source: play tone
pbs: manaei skad-a lijiu

source: frequency
pbs: lunu´t

source: time
pbs: kunju´u

source: Play a tone at frequency for time.
pbs: manaei skad-a vatei lunút lu´ui kunju´u

source: turn motor
pbs: ndatat na´ua

source: port
pbs: Ndejei'

source: power
pbs: manajap

source: rotations
pbs: likia´t

source: turn a motor
pbs: lipjia nda mana´jap

source: synchronize motors
pbs: manamejeo ra´uat peuk se utueje

source: synchronize two motors connected in PORT B and PORT C
pbs: manamejep nui na´uap re kiñxieje B y kiñxieje C

source: PORT A
pbs: kiñchieje´A

source: PORT A of the brick
pbs: kiñchieje´A del brick

source: PORT B
pbs: kiñchieje´ B

source: PORT B of the brick
pbs: kiñchieje´ B del brick

source: PORT C
pbs: kiñchieje´ C

source: PORT C of the brick
pbs: kiñchieje´ C del brick

source: synchronize motors
pbs: manamejeo ra´uat peuk se utueje

source: start motor
pbs: manapup manajap

source: Run a motor forever.
pbs: malatat nda na´ua leem

source: brake motor
pbs: manama´i manajap

source: Stop a specified motor.
pbs: lumai nda na´ua leem najui

source: reset motor
pbs: manapup manajap

source: Reset the motor counter.
pbs: lupup ne ndape én ne na´va

source: motor position
pbs: peuk lu´uinjiu´u ne na´ua

source: Get the motor position.
pbs: lumei peuk lu´ui njiu ne na´ua

source: PORT 1
pbs: kiñchieje´ 1

source: PORT 1 of the brick
pbs: kiñchieje´ 1 del brick

source: read
pbs: nu'ua

source: sensor
pbs: nda´uñ

source: Read sensor output.
pbs: ba´jau ne ndalejeiñ ne

source: PORT 2
pbs: kiñchieje´ 2

source: PORT 2 of the brick
pbs: kiñchieje´ 2 nda brick

source: light sensor
pbs: nda´ujuñ niñgyie kutsja´u

source: gray sensor
pbs: nada´ujuñ nda grises

source: PORT 3
pbs: kiñchieje´ 3

source: PORT 3 of the brick
pbs: kiñchieje´ 3 nda brick

source: touch sensor
pbs: nda´ujuñ matajau

source: distance sensor
pbs: nda´ujuñ mab- a´p

source: PORT 4
pbs: kiñchieje´ 4

source: PORT 4 of the brick
pbs: kiñchieje´ 4 nda brick

source: sound sensor
pbs: ndaujuñ se lijiu

source: color sensor
pbs: nda´ujuñ lumei xikjia´a

source: set light
pbs: lunia kutsja´u

source: Set color sensor light.
pbs: lunia nekutsja´u nada´ujuñ lumei xik´jia´a

source: battery level
pbs: peuk kausp ne ngun´iang

source: Get the battery level of the brick in millivolts
pbs: lujejeiñ péuk kausp ne nagun´iang brick

source: ERROR: Check the Arduino and the number of port.
pbs: ERROR: ndich´iu nut ne Ardiano yne nab- en ne kiñxieje´e

source: ERROR: Value must be a number from 0 to 255.
pbs: ERROR: ne ndiñjiup lumeim malaei nda nab-en´enre 0 y 255

source: ERROR: The mode must be either INPUT, OUTPUT, PWM or SERVO.
pbs: ERROR: peuk stiñjia lumem mala ei ndajei, ndalejeiñ PWMo SERVO

source: refresh Arduino
pbs: mambañ Arduino

source: pin mode
pbs: modo del pin

source: Select the pin function (INPUT, OUTPUT, PWM, SERVO).
pbs: vimia´ik se ndaei ne pin ndajei, ndalejeiñ PWM, SERVO

source: analog write
pbs: MAETS´

source: Write analog value in specified port.
pbs: gyist nda liñjiúy pu kiñchieje´luctuejé

source: analog read
pbs: ma´ajau analógico

source: Read value from analog port. Value may be between 0 and 1023. Use Vref to determine voltage. For USB, volt=((read)*5)/1024) approximately.
pbs: gyiajaut nda liñju ne kiñche je, ne liñjú k´ua lakejé kiñkié 0 y ref MA NAVAIÑ´NE MANAJAN DE usb VOLT=(( leer)*5/1024 vakja lum´ejep)

source: digital write
pbs: ma´ets matét

source: Write digital value to specified port.
pbs: gyist nda liñjú matét be kiñ cheje´vakja mamejep

source: digital read
pbs: ma´ajaú matét

source: Read value from digital port.
pbs: gyist nda liñju ne nda kiñche je´matét

source: Configure Arduino port for digital input.
pbs: vichjaut ne kiñcheje´ne Arduino njkár ndejeí matét

source: Configure Arduino port to drive a servo.
pbs: vichjaut ne kiñcheje´ne Arduino ma nakju´ne servo

source: Configure Arduino port for digital output.
pbs: vichjaut ne kiñcheje´Arduino nkajai ndalejeiñ matét

source: Configure Arduino port for PWM (pulse-width modulation).
pbs: vichjaut ne kiñcheje´Arduino ma PWM, modulacion se vates

source: Palette of Expeyes blocks
pbs: Nijang se lumei re me'ets kily'e lu'uei vani'at matsjau

source: set PVS
pbs: establecer PVS

source: IN1 level
pbs: peuk kaus in1

source: IN2 level
pbs: peuk kaus IN2

source: SEN level
pbs: peuk kaus SEN

source: SQR2
pbs: AQR2

source: resume playing video or audio
pbs: tsukuet maleiñ ne se lijiu maka'an leet

source: Title
pbs: Ngunjiu' re kily'e me'ets

source: Average RGB color from camera is pushed to the stack
pbs: Majau masau' re xikjiap' RGB ne ndake'eik leet maa pu manajap

source: yellow
pbs: niján'

source: camera output
pbs: xikji'ik se lumei ne ndake'eik leet

source: push acceleration in x, y, z to heap
pbs: lamejep pu se lu'uei lutsjau likiu' manei ravu x, y z ne manajap

source: if-then operator that uses boolean operators from Numbers palette
pbs: katsjau lik'iajam kujui vake' ne nijang se lumei rabe'en

source: jogs stack right
pbs: vikjiu't pu manajap nimia mamajap

source: Sugar Journal media object
pbs: sania' se vania'at me'ets xiñi'iu xiñi'iu ne sugar

source: box 2
pbs: ndakjaat nui

source: box 1
pbs: ndakjaat nda

source: Step
pbs: Kigyuá

source: multiplies two numeric inputs
pbs: vilyip lamejep nui ndejei' rabe'en

source: Hide palette
pbs: ma'aung nijang

source: Buddies
pbs: Majau tily'ajau

source: My Turtle Art session
pbs: pu kauk tijiap ne tortugArte

source: Sugar Journal video object
pbs: sania' ndaka'an leet xiñi'iu xiñi'iu ne sugar

source: cyan
pbs: cian

source: Load example
pbs: Maveje'p manu peuk me'ei matsjau

source: move all blocks to trash
pbs: vikia'aut mi'ia re se xik'iai'

source: media resume
pbs: ma nuap laku'

source: heading
pbs: peuk manamaa

source: Sharing blocks disabled
pbs: Skad-a make' se keich' kily'e

source: saves turtle graphics as an SVG file in the Sugar Journal
pbs: vikjiat ravu se nichjaú pu kiñkie' kumu' nkjai' navú makjat ngk'uix SVG pu xiñi'iu xiñi'iu matsjau kad-ua ninchaul

source: draws text or show media from the Journal
pbs: me'es matsjau ma'u'up kad-er se limi xiñi'iu xiñi'iu

source: video
pbs: ndaka'an let

source: blue
pbs: skusuá'

source: jogs stack down
pbs: vikjiu't pu manap nimia kupu'

source: modular (remainder) operator
pbs: katsjau sad-ia' (lijeng)

source: save SVG
pbs: makjat SVG

source: pen down
pbs: mapuu' ne nde'ets kily'e

source: wait
pbs: mapee

source: box
pbs: ndakjaat

source: Failed to upload!
pbs: Matsu' se mave'eje'p

source: shift
pbs: mantsux

source: invokes named action stack
pbs: ma'ajau ne manajap matsjau mamejep ngunju'

source: action
pbs: matsjau

source: do-until-True operator that uses boolean operators from Numbers palette
pbs: katsjau lik'iajam kujui nip peuk vake't katsjau vupaat se lumei pu nijang lumei kily'e

source: Variable 2 (numeric value)
pbs: se lu'uei liviaun' (kusau rabe'en)

source: divide
pbs: masajaik

source: picture name
pbs: ngunjiu' xikji'ik

source: while
pbs: vupee sad-ia'

source: named variable (numeric value)
pbs: se lu'uei liviaun' mamejep ngunjiu' (kusau rabe'en)

source: next
pbs: likiu'uch'

source: if then
pbs: lik'iajam xi'iap

source: set pen size
pbs: makeje' ngutue'p

source: until
pbs: lamee

source: media stop
pbs: mama'ai re se limi

source: Turn on hover help
pbs: Make' nabaik ta'ats

source: permanently deletes items in trash
pbs: viviun lem re se lumei ndakal' ngk'uix

source: top of Action 1 stack
pbs: kutap se ne manajap matsjau nda

source: Palette of flow operators
pbs: Nijang se katsjau lumei kute

source: if-then-else operator that uses boolean operators from Numbers palette
pbs: katsjau lik'iajam-kujui-nipeuk vake't katsjau vupaat se lumei pu nijang lumei kily'e

source: holds current pen shade
pbs: lumei majau masau' xikjia' ne nde'ets kily'e

source: Login failed
pbs: Ndich'u se me'ei maní

source: set heading
pbs: makeje' peuk manamá

source: <Ctrl>e
pbs: <Ctrol>e

source: horizontal space
pbs: tejiap mameje'p

source: string value
pbs: liñjup ne ngulje'e

source: description
pbs: mamang peuk vakja

source: I don't know how to
pbs: nip la'u' peuk munu'uei mu nutsjau

source: set text size
pbs: makeje' mandap re kily'e me'ets

source: Username:
pbs: k'ua' vake':

source: starts filled polygon (used with end fill block)
pbs: Mapup mane´p pu ranju'muu se me'ei mata'aun( make' se me'ei mane'ei ravú kad-a)

source: View
pbs: Man´´u

source: sets gray level of the line drawn by the turtle
pbs: mamejep majau masau se tsundue ne niñ'eje se ve'es pu kumú'

source: Password:
pbs: Kily'e se liji vupai:

source: stop action
pbs: Mama'ai kanen vatsjau

source: green
pbs: niñkijily'

source: shade
pbs: lijiú

source: fills the background with (color, shade)
pbs: viñee't pu kimviu'p lamejep (xikjia't, nixaú)

source: save picture
pbs: makjat xikji'ik

source: pitch
pbs: lunep lijiu

source: Rescale coordinates up
pbs: tajaich' maku'uts sad-ia ma kujaich'

source: pen up
pbs: majáu ne nde'ets kil'e

source: orange
pbs: ni'an

source: pauses program execution a specified number of seconds
pbs: luma'ai se sania' lustjau na'a kad-a kusau rabe'en tijia'p

source: clear all
pbs: matseiñ' mi'ia

source: then
pbs: xi'iap

source: Register
pbs: Matsjau

source: not
pbs: mut

source: if then else
pbs: lik'iajam kujui nipeuk

source: stops current action
pbs: luma'ai kanen vatsjau chu'maní

source: turns turtle clockwise (angle in degrees)
pbs: vikia't pu kumú' nimia ma kutau (angulo engrados)

source: holds current gray level (can be used in place of a number block)
pbs: lumei majau masau' se tsunduep ( lania'at lakje kujui nip manakje rabe'en)

source: displays next palette
pbs: ma'u'up ne nijang likiu'uch'

source: light level detected by camera
pbs: vakjap ne xikich ndukueje ne ndake'eik leet

source: logical less-than operator
pbs: katsjau kapat mana'p navú

source: restore all blocks from trash
pbs: vichjaut mi'ia re se lumei ngk'uix

source: store in box 1
pbs: makjaat kiñkie' nda ndajul'

source: store in box 2
pbs: makjaat kiñkie' ndakjaat nui

source: holds current x-coordinate value of the turtle (can be used in place of a number block)
pbs: lumei peuk se ma nat'ei ma nanju sad-ia' x lumei ne kumu' (lania'at lakje kujui nip manakje' rabe'en)

source: Save as Logo
pbs: Makjaat matsjau

source: sets color of the line drawn by the turtle
pbs: kiji'it ne xikjia' se mane'eima nad-es niñ'eje' ne kumu´

source: set text color
pbs: makeje' kad-er xikjia' me'ets kily'e

source: loudness
pbs: manaja

source: Enable collaboration
pbs: Manuap ma tabaik

source: Load plugin
pbs: Maveje'p plugin

source: number
pbs: rabe'en

source: top
pbs: kimvia'

source: Submit to Web
pbs: Mapai nama web

source: Nickname
pbs: vum'ejep ngunjiu'

source: set scale
pbs: makeje' peuk lu'ue lijiú

source: Share selected blocks
pbs: Skad-a make' re se vu-ua me'ets

source: white
pbs: kad-uá

source: connects action to toolbar run buttons
pbs: kia'an ne ndavaí re ndaleiñ se me'e make'

source: Cancel
pbs: Mapejeel'

source: minus
pbs: maleje'p

source: and
pbs: y

source: top of a collapsible stack
pbs: kimvia' nda manajap se vani'at mave'et

source: as input
pbs: njai' ndejei'

source: media wait
pbs: mapé re se limi

source: acceleration
pbs: navu se lu'uei lutsjau manei

source: holds current pen size (can be used in place of a number block)
pbs: lumei ne ngutue'p se chu' lumei ne nde'ets kily'e (lania'at make kujui nip make' rabe'en)

source: set color
pbs: makeje' xikjia'

source: min
pbs: sau' lakejé

source: Palette of pen commands
pbs: Nijang se vupai re nde'ets kily'e

source: do-while-True operator that uses boolean operators from Numbers palette
pbs: katsjau lik'iajam-kujui-nipeuk vake't katsjau vupaat se lumei pu nijang lumei kily'e

source: logical NOT operator
pbs: katsjau nip lupat

source: Palette of numeric operators
pbs: Nijang se lumei rabe'en make'

source: multiply
pbs: vilyip lamejep

source: forever
pbs: Leem

source: Plugin %s already installed.
pbs: Ne plugin %s majau mamejep.

source: sets shade of the line drawn by the turtle
pbs: kiji'it peuk ma vakja ne niñ'eje' se pu kumú' ve'es

source: speaks text
pbs: ve'eje' re kily'e

source: snapshot
pbs: manei

source: clean
pbs: matseiñ'

source: Grow blocks
pbs: Mandap re kily'e me'ets

source: Fullscreen
pbs: Mi'ia kutau nak'uju'ly

source: show
pbs: nda'u'up

source: text
pbs: kily'e keich'

source: random
pbs: kensemakeje'

source: logical greater-than operator
pbs: katsjau kapaat mad-uajap navú

source: turns turtle counterclockwise (angle in degrees)
pbs: vikia't pu kumú' nimia ngupeix (angelo en grados)

source: black
pbs: numvúu

source: calculates square root
pbs: vichjaut vipiat ne nikji kiñuimuu

source: holds current y-coordinate value of the turtle (can be used in place of a number block)
pbs: lumei peuk se ma nat'ei nanju sad-ia' y lumei ne kumú' (lania'at lakje' kujui nip manakje rabe'en)

source: greater than
pbs: mad-uajap navú

source: xcor
pbs: coorx

source: Help
pbs: Nabaik

source: sets color of text drawn by the turtle
pbs: makeje' peuk vakja xikjia'p re kily'e se ndutsjau pu kumú'

source: light level detected by light sensor
pbs: majau masau' kutsja'au ndukueje ne se lutsjau vani'at make'

source: Plugin could not be installed.
pbs: navú plugin nip mvania'at manam'ejep.

source: arc
pbs: ngulja'

source: radius
pbs: ngube'ei

source: set shade
pbs: makeje' peuk lu'ue lijiú

source: logical AND operator
pbs: katsjau kad-ep lupat

source: You must have an account at http://turtleartsite.sugarlabs.org to upload your project.
pbs: tumei numei peuk nu'uei njui pu http://turtleartesite.sugarlabs.org kujui luju'u lupu navu se ndul'ueje ma natsjau.
