Repository: sugar-activities/4682-activity
Catalog: po/pbs.po
Languages: pbs

source: Run
pbs: Mapai latsjau

source: sets the heading of the turtle (0 is towards the top of the screen.)
pbs: kiji'it peuk mane'ei pu kumú' (0 se maa kibia ne kutau nak'ujuly

source: microphone input volume
pbs: manaja se vat'ei vum'ejep ndape'et leet

source: Title:
pbs: Ngunjiu' kily'e me'ets:

source: Palette of media objects
pbs: Nijang se lumei kily'e nop lik'iajam ndu'et

source: Restore blocks from trash
pbs: Vichjaut mi'ia re se lumei ngk'uix

source: Palette of variable blocks
pbs: Nijang se lumei valei me'ets kad-er ndavai

source: used as numeric input in mathematic operators
pbs: make' nkjai' rabe'en se vat'ei vatsjau rabe'en

source: Upload
pbs: Maveje'p

source: Server
pbs: Katsjau

source: Variable 1 (numeric value)
pbs: lu'uei liviaun (kusau' rave'en)

source: Neighborhood
pbs: Rim'ijip

source: adds two alphanumeric inputs
pbs: lamejep lasalt nui ndejei' se lumei rabe'en

source: equal
pbs: skad-a lulejem

source: else
pbs: kad-ep

source: doesn't like
pbs: nip mvandaich'

source: stop video or audio
pbs: luma'ai ne se lijiu u ndaka'an leet

source: Turtle will not draw when moved.
pbs: Pu kumú' nip manaju'u natsjau sania' xi'iap se likia'aut.

source: pen size
pbs: ngutue'p

source: speak
pbs: nia

source: read value from RFID device
pbs: ma'ajau ne manajap pu se lumei sad-ia' ne ngube'ei (RFID)

source: moves turtle along an arc
pbs: vikia'aut pu kumú' lagu'ust' pu ngulja'

source: logical equal-to operator
pbs: katsjau kapat skad-a lulejem

source: Palette of pen colors
pbs: Nijang se lumei xikjia' nde'ets kily'e

source: pause video or audio
pbs: ma'ai ne ndaka'an leet u kad-er lijiu

source: stores numeric value in Variable 1
pbs: vikjiaat re rabe'en kupu se vania'at liviaun' nda

source: stores numeric value in Variable 2
pbs: makjaat pu rabe'en kupu se vania'at liviau'n nui

source: moves turtle backward
pbs: vikia'aut pu kumú' nimia ma ngupeix

source: Show blocks
pbs: Ma'u'up re se vud-ua me'ets

source: Colors
pbs: Xikjia'

source: sets size of the line drawn by the turtle
pbs: makeje' ne nixi'ip pu niñ'eje' se vakeje' ne kumú'

source: orientation
pbs: masep peukma

source: ycor
pbs: coory

source: if
pbs: lik'iajam

source: moves turtle to position xcor, ycor; (0, 0) is in the center of the screen.
pbs: vikia't pu kumú' nimia xcor, ycor; (0,0) vanjiu' kiñkie mejep kutau nak'ujuly'.

source: Stop
pbs: Ndama'ai

source: action 2
pbs: matsjau nui

source: action 1
pbs: matsjau nda

source: end fill
pbs: maljung se mane'p

source: Copy
pbs: Make'eik

source: Paste
pbs: Makua'al

source: did not output to
pbs: nip nduju'u ndu'uets man'eiñ

source: Activities
pbs: Ngul'ajau

source: Upload to Web
pbs: Mapai namá pu web

source: Clean
pbs: Matseiñ'

source: angle
pbs: ngumúu se liviuch' nui niñ'eje'

source: Save/Load
pbs: Makjaat/Maveje'p

source: audio
pbs: maka'an lijiu

source: subtracts bottom numeric input from top numeric input
pbs: kia'ant pu ndejei' rabe'en se vanjiu' kimviu'p navé ndejei' rabe'en se kimvia' njuts

source: media pause
pbs: Mama'ai kad-er licjau

source: clears the screen and reset the turtle
pbs: vichiñ' ne kutau nak'ujuly' tsukuet vimiaik majau ne kumú'

source: raw microphone input signal
pbs: se vat'ei vatjei ndape'et let

source: invokes Action 1 stack
pbs: maka'an ne manajap se matsjau nda

source: Palette of turtle commands
pbs: Nijang se lumei kad-er k'ua manague' ngunjiu' kumu'

source: loops forever
pbs: Meleix leem

source: show aligned
pbs: ma'u'up se makjaa't

source: Do you want to reinstall %s?
pbs: ¿Kimieng tsukuet manamejep %s?

source: Load project
pbs: Maveje'p kanen k'ua manatsjau

source: Project
pbs: Kanen se k'ua manatsjau

source: Turn off hover help
pbs: kad-ep make' ne nabaik ta'ats

source: Password
pbs: Kily'e se lumei liji vupai

source: vertical space
pbs: tejiap mamajap

source: Please restart Turtle Art in order to use the plugin.
pbs: Vipiup ne TortugArte pa ke kijiu'u kigui' ne plugin.

source: completes filled polygon (used with start fill block)
pbs: Vipiát pu ranjumuu se mata'aung nda nangaú viñe't (make' se mapup ravú kad-a

source: Share
pbs: Skad-akjee'

source: less than
pbs: mana'p navú

source: square root
pbs: nikji ne kiñui muu

source: Sugar Journal description field
pbs: tijiap se vumang peuk vakja navu xiñi'iu xiñi'iu ne sugar

source: set gray
pbs: mamejep tsuntué

source: scale
pbs: tajaich'

source: purple
pbs: niñkijiñ

source: Rescale coordinates down
pbs: Tajaich maku'uts nimia kuvú

source: click to open
pbs: mates maseiñ

source: microphone input pitch
pbs: manaja se vat'ei vum'ejep ndape'et leet

source: Configuration
pbs: Majaumatsjau

source: Description:
pbs: Mamang peuk vakja:

source: journal
pbs: xiñi'iu xiñi'iu me'ets

source: empty trash
pbs: majian ngk'uix

source: Turtle will draw when moved.
pbs: Pu kumú' laju'u' latsjau lagueje' sania' xi'iap se likia'aut.

source: Load...
pbs: Maveje'p...

source: Sugar Journal audio object
pbs: sania' se lijiu ne xiñi'iu xiñi'iu ne sugar

source: Stop turtle
pbs: Mama'ai ne kumu'

source: changes the orientation of the palette of blocks
pbs: lavaun' kale nimia ne nijang se lumei re kily'e me'ets

source: store in
pbs: makjaat kiñkiep'

source: Hide blocks
pbs: Ma'aung me'ets kily'e

source: Load Python block
pbs: Maveje'p kily'e keich' Python

source: plus
pbs: masal' mamejep

source: or
pbs: o

source: identity operator used for extending blocks
pbs: katsjau malep vake' manalei kad-er limi

source: Shrink blocks
pbs: Matseí re kily'e me'ets

source: sets size of text drawn by the turtle
pbs: kiji'it ne ngutue'p re kily'e se ndutsjau pu kumú'

source: holds current heading value of the turtle (can be used in place of a number block)
pbs: lumei kad-er vu'u' ne kumu' (lania'at make' kujui nip make' rabe'en)

source: image
pbs: xikji'ik

source: returns random number between minimum (top) and maximum (bottom) values
pbs: vikiñ ne nabe'en semanakeje kiñyep se lu'ue lulejeñ sau' malejeiñ (kimvia) maiñ kutue' lakeje (kujañ'a

source: holds current pen color (can be used in place of a number block)
pbs: lumei re xikjia' se chu' mani ne nde'ets kily'e (lania'at make' kijui ni mvake rabe'en)

source: Show palette
pbs: Ma'u'up nijang

source: saves a picture to the Sugar Journal
pbs: vikjiat nda xikji'ik pu xiñi'iu se lumei ne kad-ua niñchaul'

source: Save snapshot
pbs: Manei makjaat

source: start
pbs: ndapup

source: moves turtle forward
pbs: vikia'aut ne kumu' nimia ma kutau

source: forward
pbs: D-uaja'

source: my box
pbs: ndakjaat lapai

source: Account ID
pbs: Lumei

source: Select blocks to share
pbs: Vixa'aun re kily'e metets skad-a makee'

source: back
pbs: ma ngupeix

source: sets the scale of media
pbs: tajaich rese mimi lichjau

source: holds current scale value
pbs: lumei skad-a li'iajam ne tajaich

source: top of nameable action stack
pbs: stiñkjia'p ne manajap se vatsjaú nam'ejep ngunjiu'

source: stores numeric value in named variable
pbs: vikjiat se liñju kupu se nam'ejep ngfunjiu' se vania'at liviaun,

source: logical OR operator
pbs: katsjau nip kapat

source: microphone input voltage
pbs: manajap se llu'ujuñ re xikich' se vat'ei vum'ejep ndape'et leet

source: loops specified number of times
pbs: vilyix re rabe'en se me'eje valeima

source: Save...
pbs: Makjaat...

source: invokes Action 2 stack
pbs: maka'an ne manajap se matsjau nui

source: fill screen
pbs: mane'ep ne kutau nak'ujuly'

source: set xy
pbs: makeje' xy

source: trash
pbs: xik'iai'

source: repeat
pbs: Maleix

source: wait for current video or audio to complete
pbs: mapeé lapaá lijiu maka'an re leet

source: Save as image
pbs: Makjaat njai' xikji'ik

source: Edit
pbs: Malejeiñ

source: microphone input resistance
pbs: li'iajam ne se lu'uei lu'ujuñ xikich' se njei' pu ndejei ne ndape'et leet (navu se vat'ei tsjau':700 a 14000 ohms)

source: top of Action 2 stack
pbs: kutap se ne manajap matsjau nui

source: divides top numeric input (numerator) by bottom numeric input (denominator)
pbs: xajaik ne ndejei lumei rabe'en kuts'iñ'a (re rabe'en) kujaiñ'a ndejei' rabe'en (malejeiñ re rabe'en)

source: max
pbs: kutue' le'ei lakejé

source: start fill
pbs: mapúp mánee

source: restore all
pbs: tsukue't matsjau

source: hello
pbs: hola

source: red
pbs: nu'ua

source: identity
pbs: jui malep

source: Port
pbs: Ndejei'

source: Palette of sensor blocks
pbs: Nijang se lumei re me'ets kily'e lu'uei vani'at matsjau
